<a href="https://colab.research.google.com/github/austinlasseter/DS-Unit-2-Applied-Modeling/blob/master/module2-wrangle-ml-datasets/232_responses.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 2, Sprint 3, Module 2*

---

# Wrangle ML datasets 
- Explore tabular data for supervised machine learning
- Join relational data for supervised machine learning

### A note in preparation for Unit 3

When you're doing your initial data exploration, you're educating yourself about the data, assessing data integrity, and formulating a plan of attack for your predictive model.

The best answer to any of these questions may vary from dataset to dataset. *Experiment* with a simple model to help you through the exploratory data analysis phase.

#### Meaningful Variation
  - Are there any features that are simply constant or quasi-constant values? 
  - Duplicated features?
  - Duplicated rows?
  - Are any of your features highly correlated together?
    - Linear models can be particularly sensitive to multi-collinearity.
    - Larger (esp. wide) datasets tend to have redundant features.

#### Categorical Encodings

  - What are your high cardinality categories?
  - Are there any rare labels that might benefit from grouping together?
  - Are there any categories that could be transformed into a meaningful rank (custom ordinal encoding)?

#### Distributions

  - What are the frequencies of your categorical labels?
  - Is your target feature normally distributed? (Assumption for linear regression model)

#### Outliers
  - How sensitive is your model type to outliers?
    - Less sensitive models include tree-based models. 
    - Linear models, neural networks, and other distance-based models will almost always benefit from scaling.
  - What strategy will you use to identify and handle outliers?

#### Feature Selection

  Why should we reduce the number of features?
  - Reduces potential overfitting
  - Fewer features -> easier interpretation for your stakeholders.
  - Easier implementation and maintain by software engineers.
  - Reduced computational resource requirement.

#### Reproducibility

  - Always set a random seed.
  - Comment, comment, comment!
  - Print out versions of your software.
  - Implement version control for your *data* as well as your *code* (esp. with timestamps!)
  - Wrap your code in reproducible functions / classes for modularity of steps, including feature loading, data wrangling, feature processing, etc. (i.e., *use sklearn pipelines!*)
  - Combine your modularized functions / classes in a single, centralized pipeline to execute your modularized 
  - Print out / record your final model parameters (optimized hyperparameter values).
  - Record other details of the model: final features passed in, transformations employed, etc.(Jupyter makes this very transparent, but long notebooks can be more confusing than long-form scripts.

# Explore tabular data for supervised machine learning ðŸŒ

Wrangling your dataset is often the most challenging and time-consuming part of the modeling process.

In today's lesson, weâ€™ll work with a dataset of [3 Million Instacart Orders, Open Sourced](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2)!

Letâ€™s get set up:

In [1]:
import os
import zipfile
import shutil
from glob import glob

In [2]:
# download and unzip the datafile
!wget https://www.dropbox.com/s/pofcl26lvoj6073/instacart-market-basket-analysis.zip
!unzip instacart-market-basket-analysis.zip

--2020-10-02 00:04:23--  https://www.dropbox.com/s/pofcl26lvoj6073/instacart-market-basket-analysis.zip
Resolving www.dropbox.com (www.dropbox.com)... 162.125.82.1, 2620:100:6032:1::a27d:5201
Connecting to www.dropbox.com (www.dropbox.com)|162.125.82.1|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/pofcl26lvoj6073/instacart-market-basket-analysis.zip [following]
--2020-10-02 00:04:23--  https://www.dropbox.com/s/raw/pofcl26lvoj6073/instacart-market-basket-analysis.zip
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com/cd/0/inline/BAf9gTFLDaJQNUjAt339lWC3aKqxGE0U2UEKJDF1XF9DBWA2_4Cfdzi9TCDVoM3Ah5Dr4AqvalWEHp0NGYhcXCGwVfFoUC5LiDO9jy7TMByhwgggeHr_-v_ub2MuICx5FEg/file# [following]
--2020-10-02 00:04:23--  https://ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com/cd/0/inline/BAf9gTFLDaJQNUjAt339lWC3aKqxGE0U2UEKJDF1XF9DBWA2_4Cfdzi9TCDVoM3Ah5Dr4AqvalWEHp0NGYhcXCGwVfFoUC5LiDO9jy7TMByhwgggeHr_-v_ub2MuICx5FEg/file
Resolving ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com (ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com)... 162.125.82.15, 2620:100:6032:15::a27d:520f
Connecting to ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com (ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com)|162.125.82.15|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: /cd/0/inline2/BAcwsFOt-rYkzVrgCe3yfeiSzND0cVM_pedEHiZKm3gMIv0DsBR0b51o9cwV_OsPuXqIOO4amXXG8bwz5UnKc57rhnLXV7efhL9CKCITU-ROLWiWAXOsvQe9HIEN1XG1yZIxmtuwcBZab1K2Qb617Qtk-foKvfd1_Cc7MaHb-cftPGUE4u0e8Ud3bEHp_eUChIP2yjL-NhRnRHlerY14EJjUyHDHNbJcJUGRRrJIHkK9WLcZby2pNsuEZGSa-XkCC9WmH9HHBeadUXhBNyR6NxrTn8dAJSQKdrcTDm49PodbBKCHmCANppQVSNJk3WqiKNLJCQkt9RQO85nDhH-NaGlTe0e4rQO2eMbNkgltwatxDg/file [following]
--2020-10-02 00:04:24--  https://ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com/cd/0/inline2/BAcwsFOt-rYkzVrgCe3yfeiSzND0cVM_pedEHiZKm3gMIv0DsBR0b51o9cwV_OsPuXqIOO4amXXG8bwz5UnKc57rhnLXV7efhL9CKCITU-ROLWiWAXOsvQe9HIEN1XG1yZIxmtuwcBZab1K2Qb617Qtk-foKvfd1_Cc7MaHb-cftPGUE4u0e8Ud3bEHp_eUChIP2yjL-NhRnRHlerY14EJjUyHDHNbJcJUGRRrJIHkK9WLcZby2pNsuEZGSa-XkCC9WmH9HHBeadUXhBNyR6NxrTn8dAJSQKdrcTDm49PodbBKCHmCANppQVSNJk3WqiKNLJCQkt9RQO85nDhH-NaGlTe0e4rQO2eMbNkgltwatxDg/file
Reusing existing connection to ucd62bc1eb444dd33f882ee6c54e.dl.dropboxusercontent.com:443.
HTTP request sent, awaiting response... 200 OK
Length: 205616541 (196M) [application/zip]
Saving to: â€˜instacart-market-basket-analysis.zipâ€™

instacart-market-ba 100%[===================>] 196.09M  13.8MB/s    in 15s

2020-10-02 00:04:39 (12.9 MB/s) - â€˜instacart-market-basket-analysis.zipâ€™ saved [205616541/205616541]

Archive:  instacart-market-basket-analysis.zip
   creating: instacart-market-basket-analysis/
  inflating: __MACOSX/._instacart-market-basket-analysis
  inflating: instacart-market-basket-analysis/order_products__prior.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._order_products__prior.csv.zip
  inflating: instacart-market-basket-analysis/.DS_Store
  inflating: __MACOSX/instacart-market-basket-analysis/._.DS_Store
  inflating: instacart-market-basket-analysis/order_products__train.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._order_products__train.csv.zip
  inflating: instacart-market-basket-analysis/aisles.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._aisles.csv.zip
  inflating: instacart-market-basket-analysis/orders.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._orders.csv.zip
  inflating: instacart-market-basket-analysis/departments.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._departments.csv.zip
  inflating: instacart-market-basket-analysis/products.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._products.csv.zip

In [3]:
# Change directory to where the data was uncompressed
%cd instacart-market-basket-analysis
print(os.getcwd())

/content/instacart-market-basket-analysis
/content/instacart-market-basket-analysis

In [4]:
# unzip each of those files and move it to the current working directly
import zipfile
import shutil
from glob import glob

def get_those_files(filename):
  with zipfile.ZipFile(filename+'.csv.zip','r') as zip_ref:
      zip_ref.extractall(filename)
  shutil.move(filename+"/"+filename+".csv", filename+".csv")

for filename in ['aisles', 'departments', 'order_products__prior', 'order_products__train', 'orders', 'products']:
  get_those_files(filename)

# Print the csv filenames

for filename in glob('*.csv'):
  print (filename)

order_products__train.csv
order_products__prior.csv
orders.csv
aisles.csv
departments.csv
products.csv

### For each csv file, look at its shape & head

In [5]:
import pandas as pd
from IPython.display import display


def preview():
  for filename in glob('*.csv'):
    df = pd.read_csv(filename)
    print ('\n',filename, df.shape)
    display(df.head())

preview()

 order_products__train.csv (1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

 order_products__prior.csv (32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

 orders.csv (3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

 aisles.csv (134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

 departments.csv (21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

 products.csv (49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

## The original task was complex ...

[The Kaggle competition said,](https://www.kaggle.com/c/instacart-market-basket-analysis/data):

> The dataset for this competition is a relational set of files describing customers' orders over time. The goal of the competition is to predict which products will be in a user's next order.

> orders.csv: This file tells to which set (prior, train, test) an order belongs. You are predicting reordered items only for the test set orders.

Each row in the submission is an order_id from the test set, followed by product_id(s) predicted to be reordered.

> sample_submission.csv: 
```
order_id,products
17,39276 29259
34,39276 29259
137,39276 29259
182,39276 29259
257,39276 29259
```

## ... but we can simplify!

Simplify the question, from "Which products will be reordered?" (Multi-class, [multi-label](https://en.wikipedia.org/wiki/Multi-label_classification) classification) to **"Will customers reorder this one product?"** (Binary classification)

Which product? How about **the most frequently ordered product?**

# Questions:

- What is the most frequently ordered product?
- How often is this product included in a customer's next order?
- Which customers have ordered this product before?
- How can we get a subset of data, just for these customers?
- What features can we engineer? We want to predict, will these customers reorder this product on their next order?

## What was the most frequently ordered product?

In [6]:
order_products__train = pd.read_csv('order_products__train.csv')

In [7]:
# Product id 24852 was ordered almost 20 thousand times
# in the orders in this table
order_products__train['product_id'].value_counts()

24852    18726
13176    15480
21137    10894
21903     9784
47626     8135
         ...
44256        1
2764         1
4815         1
43736        1
46835        1
Name: product_id, Length: 39123, dtype: int64

In [29]:
# show a few orders with that product in them
temp = order_products__train[order_products__train['product_id']==24852]
print(len(temp))
temp.head()

18726

     order_id  product_id  add_to_cart_order  reordered
115       226       24852                  2          0
156       473       24852                  2          0
196       878       24852                  2          1
272      1042       24852                  1          1
297      1139       24852                  1          1

In [30]:
# Read the products table, to
# figure out the product name for product id 24852
products = pd.read_csv("products.csv")
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [11]:
# merge the tables together
train = pd.merge(order_products__train, products, on='product_id', how='inner')

In [32]:
# looks like it's a banana
train[train['product_id']==24852].head()

        order_id  product_id  ...  department_id  bananas
129688       226       24852  ...              4     True
129689       473       24852  ...              4     True
129690       878       24852  ...              4     True
129691      1042       24852  ...              4     True
129692      1139       24852  ...              4     True

[5 rows x 8 columns]

In [12]:
# that's a lot of bananas!
train['product_name'].value_counts()

Banana                          18726
Bag of Organic Bananas          15480
Organic Strawberries            10894
Organic Baby Spinach             9784
Large Lemon                      8135
                                ...
Pact Cranberry Concord Grape        1
Passionberry Twist                  1
Just Croutons, Garlic               1
Organic Spinach Pow Salad           1
Green Tea Dandelion                 1
Name: product_name, Length: 39123, dtype: int64

## How often is this product included in a customer's next order?

There are [three sets of data](https://gist.github.com/jeremystan/c3b39d947d9b88b3ccff3147dbcf6c6b):

> "prior": orders prior to that users most recent order (3.2m orders)  
"train": training data supplied to participants (131k orders)  
"test": test data reserved for machine learning competitions (75k orders)

Customers' next orders are in the "train" and "test" sets. (The "prior" set has the orders prior to the most recent orders.)

We can't use the "test" set here, because we don't have its labels (only Kaggle & Instacart have them), so we don't know what products were bought in the "test" set orders.

So, we'll use the "train" set. It currently has one row per product_id and multiple rows per order_id.

But we don't want that. Instead we want one row per order_id, with a binary column: "Did the order include the product?"

Let's wrangle!

In [33]:
# add a new boolean column
train['bananas'] = train['product_name'] == 'Banana'
train.head()

   order_id  product_id  add_to_cart_order  ...  aisle_id department_id  bananas
0         1       49302                  1  ...       120            16    False
1    816049       49302                  7  ...       120            16    False
2   1242203       49302                  1  ...       120            16    False
3   1383349       49302                 11  ...       120            16    False
4   1787378       49302                  8  ...       120            16    False

[5 rows x 8 columns]

In [34]:
# 1.4% of the products ordered are (non-organic) bananas
train['bananas'].value_counts(normalize=True)

False    0.986476
True     0.013524
Name: bananas, dtype: float64

In [35]:
# For each order, were any of the products bananas?
train_wrangled = train.groupby('order_id')['bananas'].any().reset_index()

In [36]:
# ~ 14% of orders included bananas
train_wrangled['bananas'].value_counts(normalize=True)

False    0.857281
True     0.142719
Name: bananas, dtype: float64

In [37]:
# How often is this product (i.e., bananas) included in the customer's next order?
train_wrangled = train.groupby('order_id')['bananas'].any().reset_index()
train_wrangled

        order_id  bananas
0              1    False
1             36    False
2             38    False
3             96    False
4             98    False
...          ...      ...
131204   3421049    False
131205   3421056    False
131206   3421058    False
131207   3421063    False
131208   3421070    False

[131209 rows x 2 columns]

# Join relational data for supervised machine learning

## Overview
Often, youâ€™ll need to join data from multiple relational tables before youâ€™re ready to fit your models.

## Which customers have ordered bananas before?

- Customers are identified by `user_id`
- Products are identified by `product_id`

Do we have a table with both these id's? 

(If not, how can we combine this information?)

No, we don't have a table with both these id's. But:
- `orders.csv` has `user_id` and `order_id`
- `order_products__prior.csv` has `order_id` and `product_id`
- `order_products__train.csv` has `order_id` and `product_id` too

In [38]:
# In the train table, which orders included bananas?
train[train.bananas==True].head()

        order_id  product_id  ...  department_id  bananas
129688       226       24852  ...              4     True
129689       473       24852  ...              4     True
129690       878       24852  ...              4     True
129691      1042       24852  ...              4     True
129692      1139       24852  ...              4     True

[5 rows x 8 columns]

In [41]:
# get the order ID's for bananas
banana_order_ids = train[train.bananas==True].order_id
banana_order_ids.head()

129688     226
129689     473
129690     878
129691    1042
129692    1139
Name: order_id, dtype: int64

In [42]:
# Look at the orders table
orders = pd.read_csv('orders.csv')
orders.sample(n=5)

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
2916623   1328471   175950  ...                16                     1.0
2254365   2724029   135780  ...                16                     4.0
2917424   2161161   176011  ...                12                     3.0
2669439   1944936   160690  ...                 8                    15.0
643035    2101881    38739  ...                10                     5.0

[5 rows x 7 columns]

In [43]:
# In the orders table, which orders included bananas?
orders[orders.order_id.isin(banana_order_ids)]

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
25        1492625        2  ...                11                    30.0
485        698604       34  ...                13                    30.0
623       1864787       43  ...                11                    26.0
652       1947848       46  ...                20                    11.0
881         13318       56  ...                 9                     6.0
...           ...      ...  ...               ...                     ...
3420581    681092   206181  ...                13                    30.0
3420692   2530125   206191  ...                 9                    30.0
3420786   3383615   206196  ...                15                    30.0
3420933   1716008   206205  ...                16                    10.0
3421082    272231   206209  ...                14                    30.0

[18726 rows x 7 columns]

In [45]:
# Check an order_id from above, confirm that yes it includes bananas
train[train.order_id==1492625].head()

        order_id  product_id  ...  department_id  bananas
40632    1492625       11913  ...             19    False
137883   1492625       24852  ...              4     True
199519   1492625        9387  ...              4    False
202785   1492625       45066  ...              4    False
241750   1492625        5450  ...              4    False

[5 rows x 8 columns]

In [46]:
# get the orders that had bananas
banana_orders = orders[orders.order_id.isin(banana_order_ids)]
banana_orders.head()

     order_id  user_id  ... order_hour_of_day  days_since_prior_order
25    1492625        2  ...                11                    30.0
485    698604       34  ...                13                    30.0
623   1864787       43  ...                11                    26.0
652   1947848       46  ...                20                    11.0
881     13318       56  ...                 9                     6.0

[5 rows x 7 columns]

In [49]:
# In the orders table, which users have bought bananas?
banana_user_ids = banana_orders.user_id.unique()
banana_user_ids[:5]

array([ 2, 34, 43, 46, 56])

## How can we get a subset of data, just for these customers?

We want *all* the orders from customers who have *ever* bought the product.

(And *none* of the orders from customers who have *never* bought the product.)

In [50]:
# orders table, shape before getting subset
orders.shape

(3421083, 7)

In [51]:
# orders table, shape after getting subset
orders_subset = orders[orders.user_id.isin(banana_user_ids)]
orders_subset.shape

(332661, 7)

In [52]:
# look at the first 5
orders_subset.head()

    order_id  user_id  ... order_hour_of_day  days_since_prior_order
11   2168274        2  ...                11                     NaN
12   1501582        2  ...                10                    10.0
13   1901567        2  ...                10                     3.0
14    738281        2  ...                10                     8.0
15   1673511        2  ...                11                     8.0

[5 rows x 7 columns]

## What features can we engineer? We want to predict, will these customers reorder bananas on their next order?

- Products per order
- Time of day
- Have they reordered bananas before? (Have ordered bananas >= 2 times)
- Other fruit they buy 
- Size of orders (customers with smaller orders on average are less likely to be reordering any particular product on their next order)


- Frequency of banana orders:
    - % of orders 
    - Time between banana orders: Every n days on average
    - Raw count: Total orders, how many times have you ordered bananas?

- Recency of banana orders
    - n days since you ordered banana

In [57]:
len(orders_subset)

332661

In [58]:
# Pick out an individual user for exploration & experiments
USER_ID = 2
my_user = orders_subset[orders_subset.user_id==USER_ID]
my_user

    order_id  user_id  ... order_hour_of_day  days_since_prior_order
11   2168274        2  ...                11                     NaN
12   1501582        2  ...                10                    10.0
13   1901567        2  ...                10                     3.0
14    738281        2  ...                10                     8.0
15   1673511        2  ...                11                     8.0
16   1199898        2  ...                 9                    13.0
17   3194192        2  ...                12                    14.0
18    788338        2  ...                15                    27.0
19   1718559        2  ...                 9                     8.0
20   1447487        2  ...                11                     6.0
21   1402090        2  ...                10                    30.0
22   3186735        2  ...                 9                    28.0
23   3268552        2  ...                11                    30.0
24    839880        2  ...                10                    13.0
25   1492625        2  ...                11                    30.0

[15 rows x 7 columns]

## Challenge

**Continue to clean and explore your data.** Can you **engineer features** to help predict your target? For the evaluation metric you chose, what score would you get just by guessing? Can you **make a fast, first model** that beats guessing?

We recommend that you use your portfolio project dataset for all assignments this sprint. But if you aren't ready yet, or you want more practice, then use the New York City property sales dataset today. Follow the instructions in the assignment notebook. [Here's a video walkthrough](https://youtu.be/pPWFw8UtBVg?t=584) you can refer to if you get stuck or want hints!